# StairstypeNotchVerticalGap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeNotchVerticalGap Property
ParameterTypeId Class See Also
---
"Vertical Gap Distance":
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeNotchVerticalGap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeNotchVerticalGap As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeNotchVerticalGap {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace